app/views/meetings/index.html.erb

<%= link_to meeting.restaurant.name, meeting.restaurant.url %><br>
Guest: <%= meeting.users.where.not(id: params[:user_id]).first.name%><br>
---
SELECT  "users".* FROM "users"  ORDER BY "users"."id" ASC LIMIT 1