app/controllers/meetings_controller.rb

  def index
    # binding.pry
    # @meetings = Meeting.where(user_id: params[:user_id])
    # @meetings = User.find(params[:user_id]).meetings
    # Meeting.joins(guests: [{invitations: :user}]).where(user_id: params[:user_id])
    # @meetings = Meeting.select('meetings.*').joins(guests: {invitation: :user}).group('id').where(user_id = params[:id])
    @user = User.find(params[:user_id])
    meetings = @user.meetings
    @meetings = meetings.sort_by{|meeting| meeting.created_at}.reverse
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 5]]
INSERT INTO "meetings" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2015-11-02 22:59:58.567807"], ["updated_at", "2015-11-02 22:59:58.567807"]]
INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Austin"], ["email", "austin@flatiron.com"], ["password_digest", "austin"], ["created_at", "2015-11-02 22:59:58.538372"], ["updated_at", "2015-11-02 22:59:58.538372"]]

  def show
     @user = User.find(params[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 5]]