app/controllers/meetings_controller.rb

  def index
    # binding.pry
    # @meetings = Meeting.where(user_id: params[:user_id])
    @meetings = Meeting.find(params[:user_id])
---
SELECT  "meetings".* FROM "meetings" WHERE "meetings"."user_id" = '1'  ORDER BY "meetings"."id" ASC LIMIT 1