app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT 1  [["email", "may@flatiron.com"]]
---
  def create
    # binding.pry
    user = User.find_by_email(params[:email])